Revit 2027 API
RebarBendingDetail.ResetAnnotationPositions Method
 Resets the positions of the bending detail annotations to the default position.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void ResetAnnotationPositions(
	Element bendingDetail
)
Public Shared Sub ResetAnnotationPositions (
	bendingDetail As Element
)
public:
static void ResetAnnotationPositions(
	Element^ bendingDetail
)
static member ResetAnnotationPositions :
        bendingDetail : Element -> unit
Parameters
bendingDetail Element
 The bending detail element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace